{
    "Header.Item1": "About me",
    "Header.Item2": "Experience",
    "Header.Item3": "Projects",
    "Header.Item4": "Contact",
    "Header.cvBtn": "Resume",
    "Header.cvName": "vamsi_ravilisetti_resume.pdf",
    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": "I have <span class='underline'>2.5 years of experience</span> developing systems, interfaces, bots, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular, NodeJS and JavaScript, TypeScript</span> and sometimes in <span class='underline'>Python</span> applying good practices and development standards.",
    "Banner.ActionBtn": "Get in touch",
    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
        "In my <span class='underline'>2.5 years as a developer</span>, I seek to train every day. I have worked writing <span class='underline'>unit tests</span>, <span class='underline'>performing continuous integration</span>, and covering backend developer roles with <span class='underline'>MongoDB and Mysql</span>. I have led teams having empathy, exercising motivation to partners, and setting plans and goals together.",
        "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
        "Some of the technologies that I have trained and worked on include (but are not limited to):"
    ],
    "Experience.Title": "Experience",
    "Experience.Jobs": [
        {
            "Tab": "Knoxpo",
            "Title": "Angular developer",
            "Date": "September 2023 - Present",
            "Description": [
                "Developed and maintained Angular applications resulting in increased increased efficiency by 20% in 3 months.",
                "Designed and implemented RESTful APIs to support multiple applications, using angular.",
                "Led front-end development of a EKYC project from built scratch using Angular with Micro-front end architecture.",
                "Implementation of continuous integration and daily backups.",
                "Leading a team of 4 people in the development of a EKYC platform made in Angular, Java, and MongoDB.",
                "Planning meetings in reports.",
                "Implemented responsive design using HTML and CSS resulting in 15% increase in user engagement."
            ]
        },
        
        {
            "Tab": "LTIMindtree",
            "Title": "Software Engineer",
            "Date": "September 2021 - August 2023",
            "Description": [
                "Developed and maintained web applications using Angular.",
                "Implementation CI / CD in AWS. Refactoring and optimizing application load times.",
                "Coding of API requests with RxJS.",
                "Creation of modules with complex reactive forms",
                "Improved website performance by optimizing images and implementing caching techniques.",
                "Collaborated with designers and back-end developers to create responsive and user-friendly web experiences"
            ]
        }
    ],
    "FeatureProjects.Title": "Projects that I was a part of",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [
        {
            "Title": "Knoxpo EKYC Project",
            "Description": "E-KYC or electronic Know Your Customer is essentially the process by which KYC is done. So, eKYC is when authorised organisations and agents verify a customer’s identity and address digitally",
            "imgs": [
                "assets/images/EKYC/image1.png",
                "assets/images/EKYC/image2.png",
                "assets/images/EKYC/image3.png"
            ],
            "Technologies": [
                "Angular",
                "SASS",
                "Angular CDK",
                "RxJS"
            ]
        },
        {
            "Title": "Connect 365 Automated Email campaign project",
            "Description": "Connect 365 is a client attraction and sales automation platform that provides simple solutions to help small and medium sized businesses start more sales conversations with qualified prospects every day of the year while <span class='underline'> eliminating 90% of their marketing workload.</span>",
            "imgs": [
                "assets/images/c365/image1.png",
                "assets/images/c365/image2.png",
                "assets/images/c365/image2.png"
            ],
            "Technologies": [
                "Angular",
                "SASS",
                "TypeScript",
                "RxJS",
                "JavaScript",
                "Ionic"
            ]
        },
        {
            "Title": "L & T Electrical Smartshopt",
            "Description": "L & T Electrical Smart shop is an e-commerce project in collaboration with Schneider Electric where all the electrical products user can buy. This project will be going to be operational in India and European countries.",
            "imgs": [
                "assets/images/LTI/image1.png",
                "assets/images/LTI/image2.png",
                "assets/images/LTI/image3.png",
                "assets/images/LTI/image4.png"
            ],
            "Technologies": [
                "Amgular",
                "SASS",
                "Material",
                "GraphQl",
                "Magento"
            ]
        }
    ],
    "OtherProjects.Title": "More personal projects",
    "OtherProjects.Projects": [
        {
            "Title": "Covid Tracker",
            "Description": "Covid Tracker is a web app which is built using the 3rd Party Api integration. This app shows the records from worldwise and countrywise that shows the who much patient are suffer from covid who many died from covid and how many are recoverd from covid",
            "ghLink": "https://github.com/mufeez1/carona19-tracker",
            "demoLink": "http://carona19-by-muffeez.surge.sh/",
            "Technologies": [
                "Angular",
                "RxJs",
                "API",
                "Bootstrap"
            ]
        },
        {
            "Title": "Lets Chat",
            "Description": "A real-time chat application. Another fun side project :)",
            "ghLink": "https://github.com/mufeez1/lets-chat",
            "Technologies": [
                "React",
                "SASS",
                "Socket.io",
                "NodeJS",
                "ExpressJS",
                "Firebase"
            ]
        },
        {
            "Title": "Quiz App",
            "Description": "A single page quiz app that has a minimal design, that has different level to attempt quizes.",
            "ghLink": "https://github.com/mufeez1/quizapp",
            "demoLink": "https://github.com/mufeez1/quizapp",
            "Technologies": [
                "React",
                "SASS",
                "TypeScript",
                "API",
                "3rd Party Library"
            ]
        },
        {
            "Title": "JWT Integration",
            "Description": "JWT AUTHENTICATION IN NODE JS WITH POSTGREESQL DB",
            "ghLink": "https://github.com/mufeez1/node-jwt",
            "demoLink": "https://github.com/mufeez1/node-jwt",
            "Technologies": [
                "React",
                "JWT",
                "ExpressJS",
                "POSTGREESQL"
            ]
        }
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
    "Contact.Btn": "Say Hello"
}